app/controllers/users_controller.rb

   def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE (name LIKE '%root%')
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 105)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('Johnny', 'j@j.com', '2011-04-20 15:04:23.916971', '2011-04-20 15:04:23.916971', 'e0a5a751fde1d86dd30613c96ddb2451aa9355bae3adb3ca1e4fafe152e73586', 'd9d0f17c12a41f37136b8e7c13d81f16d7e2fd42fc8df784c58e426b58fbd71f', NULL)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = 'd56e7a6e612a99e3d75f1b8dd6047ced3a22143eb9450502191c3b6f67ca7d2a', "updated_at" = '2011-04-26 19:23:14.949997' WHERE "users"."id" = 1